import * as path from "node:path";

export const OUTPUT_DIR = path.join(process.cwd(), "themes");

/**
 * The background color is ported from [Dracula Theme](https://github.com/dracula/dracula-theme)
 *
 * Licensed under MIT.
 */
export const DarkBackground = "#282a36";

export const AvaColor = {
  /** 天蓝色 */
  应援色: "#9ac8e2",

  /** 浅蓝色 */
  头发: "#c4c7f6",
  /** 长春花色 */
  头发暗部: "#949ae1",
  /** 淡紫色 */
  发梢: "#d3a8f0",
  /** 白色 */
  皮肤: "#fff4e4",
  /** 靛蓝色 */
  眼睛: "#29305f",
  /** 靛蓝色 */
  眼睛亮部: "#535b9d",
  /** 浅蓝色 */
  眼睛高亮: "#848fe2",
  /** 浅蓝色 */
  眼睛高高亮: "#d8e7f9",
  /** 深红色 */
  眉毛: "#56251e",

  /** 浅蓝色 */
  裙子: "#acc3f1",
  /** 深紫色 */
  裙子深色: "#302d63",
  /** 紫色 */
  裙子下部: "#8f83a8",

  /** 淡紫色 */
  头饰: "#9379e2",
  /** 淡紫色 */
  头饰飘带: "#b790f6",
  /** 浅橙色 */
  领结: "#fcbf5c",
  /** 深紫色 */
  鞋子: "#302d62",
} as const;

export const BellaColor = {
  /** 红色 */
  应援色: "#db7d74",

  /** 靛蓝色 */
  头发: "#56537b",
  /** 靛蓝色 */
  头发亮部: "#6f6b98",
  /** 长春花色 */
  头发高亮: "#d8daeb",
  /** 白色 */
  皮肤: "#fff3ea",
  /** 紫色 */
  眼睛: "#4c519c",
  /** 长春花色 */
  眼睛亮部: "#8990e0",
  /** 长春花色 */
  眼睛高亮: "#aeb2ea",
  /** 深紫色 */
  眉毛: "#150525",

  /** 红色 */
  衣服: "#f94060",
  /** 红色 */
  衣服暗部: "#d31848",
  /** 深灰色 */
  裙子: "#3c3c3c",

  /** 红色 */
  蝴蝶结: "#f9404c",
  /** 浅橙色 */
  黄星头饰: "#ffcf6b",
  /** 红色 */
  红星头饰: "#ff3e62",
};

export const CarolColor = {
  /** 淡紫色 */
  应援色: "#b8a6d9",

  /** 紫色 */
  头发: "#6e6586",
  /** 淡紫色 */
  头发亮部: "#e0d2ef",
  /** 深紫色 */
  头发暗部: "#443660",
  /** 浅蓝色 */
  头发挑染: "#c1b0fa",
  /** 白色 */
  皮肤: "#fffaf2",
  /** 深蓝色 */
  眼睛: "#120140",
  /** 深紫色 */
  眼睛亮部: "#4e3d7c",
  /** 淡紫色 */
  眼睛高亮: "#f8d4ff",
  /** 深紫色 */
  眉毛: "#4b1d49",

  /** 靛蓝色 */
  衣服: "#383a59",
  /** 深紫色 */
  衣服暗部: "#2b283d",
  /** 靛蓝色 */
  裙子: "#393842",

  /** 淡紫色 */
  领带: "#e3d1f3",
  /** 靛蓝色 */
  鞋子: "#363640",
} as const;

export const DianaColor = {
  /** 玫瑰色 */
  应援色: "#e799b0",

  /** 茶色 */
  头发: "#d0a48f",
  /** 浅橙色 */
  头发亮部: "#f7e1c1",
  /** 褐色 */
  头发暗部: "#9b6459",
  /** 白色 */
  皮肤: "#fef5ed",
  /** 深蓝色 */
  眼睛: "#244176",
  /** 蓝色 */
  眼睛亮部: "#6ea3d4",
  /** 天蓝色 */
  眼睛高亮: "#cef7fe",
  /** 深红色 */
  眉毛: "#54251f",

  /** 玫瑰色 */
  衣服: "#f2adad",
  /** 玫瑰色 */
  衣服暗部: "#e7728a",
  /** 浅黄色 */
  裙子: "#faeb97",

  /** 浅黄色 */
  头饰: "#fff6b2",
  /** 浅橙色 */
  领结: "#fba663",
  /** 深红色 */
  鞋子: "#5a2c24",
} as const;
